
#include <stdio.h>

int main()
{
    /*
     * 数组在内存中的存储细节
     *
     * 定义数组分配内存的规则:
     * 1.给整个数组分配内存的时候, 和普通变量一样, 是从内存地址大的开始分配
     * 2.给数组中的每一个元素分配内存空间的时候, 是从已经分配好的内存地址最小的开始分配
     *
     * 往数组中存储数据的规则:
     * 和变量往内存中存储数据一样, 从自己占用内存地址比较大的开始存储
     */

    int num1[3];
    num1[0] = 1; //0000 0000 0000 0000 0000 0000 0000 0001
    num1[1] = 3; //0000 0000 0000 0000 0000 0000 0000 0011
    num1[2] = 5; //0000 0000 0000 0000 0000 0000 0000 0101

    printf("&num = %p\n", &num1);       // &num = 0060FEA4
    printf("&num[0] = %p\n", &num1[0]); // &num[0] = 0060FEA4
    printf("&num[1] = %p\n", &num1[1]); // &num[1] = 0060FEA8
    printf("&num[2] = %p\n", &num1[2]); // &num[2] = 0060FEAC
//    int num2[3] = {2, 4, 6};

    return 0;
}
