#include <stdio.h>

int main()
{
    /*
     * 注意点:
     * 1.+ - * /
     * 在+ - * / 运算中, 如果整数和整数运算, 那么得到的结果一定是整数, 如果整数和小数运算, 那么得到的结果一定是小数
     * 2.%
     * 2.1在%运算中, 不能出现小数(%运算只能计算整数)
     * 2.2在%运算中, 如果被除数小于除数, 那么结果就是被除数
     * 2.3在%运算中, 如果被除数是0, 那么结果就是0
     * 2.4在%运算中, 结果的正负性, 取决于被除数的正负性(被除数如果正数, 那么结果就是正数, 被除数如果是负数, 那么结果就是负数)
     */
//    double result;
//    result = 10 / 3; // 3
//    result = 10 / 3.0; // 3.333333
//    result = 10.0 / 3; // 3.333333
//    result = 10.0 / 3.0; // 3.333333
//    printf("result = %lf\n", result);
    int result;
//    result = 10 % 3;
//    result = 10 % 3.0;
//    result = 10.0 % 3;
//    result = 2 % 3;
//    result = 0 % 3;
//    result = 10 % -3; // 1
    result = -10 % 3; // -1
    printf("result = %i\n", result);
    return 0;
}
