
#include <stdio.h>

int main()
{
    /*
     * 前面我们学习的指针我们称之为一级指针
     * 什么是多级指针
     * 指针中保存的又是其它指针的地址, 我们就称之为多级指针
     * 如何定义多级指针
     * 在要保存的指针变量的基础上加一颗星即可
     * 例如: int *p;  如果想保持指针变量p的地址, 只需在定义时多加一颗星即可 int **pp;
     *
     * 访问的规则:pp
     * 如果定义就如何范围, 例如: int *p; 访问 *p;  例如: int **pp; 访问 **pp;
     *
     * 定义指针的规律:
     * 1.将要指向的变量的定义拷贝过来
     * 2.再拷贝过来的代码的类型和变量名称中间加上一颗星
     * 3.修改变量名称
     */

    int num;
    num = 6;

    // 一级指针
    int *p;
    p = &num;
    printf("*p = %i\n", *p); // 6


    // 取出变量num的地址
//    printf("&num = %p\n", &num); // &num =  0060FEAC
    // 取出p中存储的地址
//    printf("p = %p\n", p); // p =  0060FEAC
//    printf("&p = %p\n", &p); // &p = 0060FEA8


    // 二级指针
    int **pp;
    pp = &p;
//    printf("&pp = %p\n", &pp); // &pp = 0060FEA4
    // 结论: *pp == p == &num;
//    printf("*pp = %p\n", *pp); // *pp = 0060FEAC

    //   *(*pp)  --> *(p) --> *p --> num
    // 规律: 如果想通过多级指针获取某个变量的值, 那么是几级指针, 前面就写几颗星即可
    // 注意点: 在企业开发中, 最多二级指针, 三级顶天了, 四级没讲过
    printf("**pp = %i\n", **pp);

    // 三级指针
    int ***ppp;
    ppp = &pp;
    printf("***pp = %i\n", ***ppp);

    return 0;
}
