#include <stdio.h>

int main()
{
    /*
    // a -> 97 -> 0110 0001
    // b -> 98 -> 0110 0010
    //               0    1
    char chs1[2] = {'a', 'b'};
    // c -> 99 -> 0110 0011
    // d -> 100 -> 0110 0100
    char chs2[2] = {'c', 'd'};

    // 数组的索引是从0开始
    // 如果索引不在数组的规定的索引范围内, 那么有可能会报错, 也有可能会取出一个不是自己的值
    // 注意点: 在使用数组的过程中一定不能超出数组索引的范围
    // 范围从0开始, 到元素个数-1;
//    printf("chs1[-1] = %c\n", chs1[-1]);
//    printf("chs2[2] = %c\n", chs2[2]);

    printf("chs2[9998] = %c\n", chs2[9998]);
    */

    int nums[5] = {[4] = 3,[1] = 2};
    for(int i = 0; i < 4; i++){
        printf("%i\n", nums[i]);
    }
    return 0;
}
