#include <stdio.h>
int test(int n);
int main()
{
    /*
     * 利用递归实现N的阶乘
     * 3! = 3 * 2 * 1
     * 2! = 2 * 1
     * 1! = 1
     *
     * 和刚才b的n次方同一个世界同一个梦想, 自己总结规律
     *
     * 1! = 1
     * 2! = 1 * 2
     * 3! = 1 * 2 * 3
     * 4! = 1 * 2 * 3 * 4
     *
     * 1! = 1
     * 2! = 1! * 2
     * 3! = 2! * 3
     * 4! = 3! * 4
     *
     * 规律: n! = (n-1)! * n
     */

    /*
     * 在企业开发中, 一般情况下能够使用递归实现的功能, 都能使用循环实现, 所以一般情况下不会使用递归
     * 递归在面试中出现得比较多, 还有就是在文件操作中使用得比较多
     */
//    printf("res = %i\n", 1 * 2 * 3 * 4);
    int res = test(4);
    printf("res = %i\n", res);
    return 0;
}
int test(int n){
    if(n == 1){
        return 1;
    }else{
        return test(n - 1) * n;
    }
}
