#include <stdio.h>

int main()
{
    /*
     * 逻辑运算符
     * 1.逻辑与 &&
     * 格式: 表达式 && 表达式
     * 结果: 和关系运算符一样 0 和 1
     * 规则: 一假则假
     * 2.逻辑或 ||
     * 格式: 表达式 || 表达式
     * 结果: 和关系运算符一样 0 和 1
     * 规则: 一真则真
     * 3.逻辑非 !
     * 格式: !表达式
     * 结果: 和关系运算符一样 0 和 1
     * 规则: 真变假假变真
     */
    /*
    //         表达式1      表达式2
    //         1(真)         1(真)
    //        10 > 5 并且 20 > 19
//    int res = (10 > 5) && (20 > 19);
    //         0(假)         1(真)
//    int res = (10 > 11) && (20 > 19);
    //         1(真)         0(假)
    int res = (10 > 9) && (20 > 29);
    printf("res = %i\n", res); // 1 0
    */

    /*
    //          1(真)  ||   1(真)
//    int res = (10 > 9) || (20 > 8);
    //          0(假)  ||   1(真)
//    int res = (10 > 11) || (20 > 8);
    //          1(真)  ||   0(假)
    int res = (10 > 1) || (20 > 28);
    printf("res = %i\n", res);
    */

    //        !1(真)
//    int res = !(10 > 9);
    //        !0(假)
    int res = !(10 > 19);
    printf("res = %i\n", res);
    return 0;
}
