#include <stdio.h>

int main()
{

    /*
     * & 按位与
     * 规则: 一假则假
     * 规律: 任何一位和1相与, 结果还是原来的那一位
     * 0000 0000 0000 0000 0000 0000 0000 0001 // 1的补码
     *&0000 0000 0000 0000 0000 0000 0000 0001
     * -----------------------------------------
     * 0000 0000 0000 0000 0000 0000 0000 0001
     *
     * 0000 0000 0000 0000 0000 0000 0000 0000 // 0的补码
     *&0000 0000 0000 0000 0000 0000 0000 0001
     * -----------------------------------------
     * 0000 0000 0000 0000 0000 0000 0000 0000
     *
     * 0000 0000 0000 0000 0000 1011 0000 0000 // 0的补码
     *&0000 0000 0000 0000 0000 1111 0000 0000
     * -----------------------------------------
     * 0000 0000 0000 0000 0000 1011 0000 0000
     *
     */
//    int res1 = 1 & 1;
//    printf("%i\n", res1);
//    int res2 = 0 & 1;
//    printf("%i\n", res2);

    /*
     *
     * ^ 按位异或
     * 规则: 相同为0, 不同为1
     * 规律:
     * 1.任何两个相同的值异或之后的结果都是0
     * 2.任何一个数和0异或之后的结果还是那个数
     * 3.任何一个数异或另外一个数两次之后, 结果还是那个数
     */
//    int res1 = 5 ^ 5;
//    printf("%i\n", res1);
//    int res2 = 9 ^ 9;
//    printf("%i\n", res2);

//    int res1 = 5 ^ 0;
//    printf("%i\n", res1);
//    int res2 = 9 ^ 0;
//    printf("%i\n", res2);

//    int res1 = 18 ^ 5 ^ 5;
//    printf("%i\n", res1);
//    int res2 = 22 ^ 9 ^ 9;
//    printf("%i\n", res2);

    // 应用场景: 简单的加密
    int pwd = 123456789;
    int res = pwd ^ 998;
    printf("加密之前: %i\n", pwd);
    printf("加密之后: %i\n", res);
    int res2 = res ^ 998;
    printf("解密之后: %i\n", res2);
    return 0;
}
