#include <stdio.h>

int main()
{
    /*
     * 1.printf作用:
     * 把指定的数据输出到屏幕上
     * 2.printf格式:
     * printf("输出的内容");
     * printf("格式化字符串", 输出列表项);
     * 3.格式化字符串格式:
     * %[标志][输出宽度][.精度][长度]类型
     */
    /*
     * 1.宽度格式:
     * %[输出宽度]类型
     * 2.宽度作用:
     * 指定输出内容的位数
     * 如果输出内容实际的宽度大于或者等于指定的宽度, 那么会按照实际输出内容的宽度输出
     * 如果输出内容实际的宽度小于指定的宽度, 那么会在实际输出内容的前面添加空格
     */
//    int num = 999;
//    printf("|%i|\n", num);
//    printf("|%1i|\n", num); // 宽度小于实际位数
//    printf("|%3i|\n", num); // 宽度等于实际位数
//    printf("|%5i|\n", num); // 宽度大于实际位数
    /*
     * 1.标志格式:
     * %[标志]类型
     * %[标志][输出宽度]类型
     * 2.标志作用:
     * +	当输出值为正数时,在输出值前面加上一个+号, 默认不显示
     * 空格	输出值为正数时,在输出值前面加上空格, 为负数时加上负号
     * -	左对齐, 默认右对齐
     * 0	右对齐时, 用0填充宽度.(默认用空格填充)
     */
    /*
    int num = 999;
    printf("%i\n", num);
//    printf("%+i\n", num);
//    printf("% i\n", num);
    printf("|%5i|\n", num); // 指定宽度
    printf("|%-5i|\n", num); // 指定标志和宽度
    */
    int num = 1;
    printf("%i\n", num);
    printf("|%2i|\n", num); // 指定宽度
    printf("|%02i|\n", num); // 指定标志和宽度
    // 2015-01-08
    return 0;
}
